snlkuharlocal/src/Documents/РекламационнаяНакладная/РекламационнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РекламационнаяНакладная</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.АктПриемки</basedOn>
  <basedOn>Document.ЗаявкаНаРекламацию</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТМЦКомиссия</registerRecords>
  <registerRecords>AccumulationRegister.Профит</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.РасхожденияПоАкту</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктПриемки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПоОстаткам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРекламации</name>
    <type>
      <types>EnumRef.ВидыРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРНК</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВозврата</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСкидкиДС</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомиссия</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКомиссия</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПретензияПолучателя</name>
    <type>
      <types>DocumentRef.ПретензияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаВозвратОтПокупателя</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРекламацию</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРекламацию</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПретензии</name>
      <comment>КодНоменклатуры+НомерСтроки документа ПретензияПокупателя (для вывода причин рекламаций)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШКМаркиКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУКонтрагента</name>
      <type>
        <types>EnumRef.СтатусыМарокУКонтаргента</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>количество штук в маркировке (короб это или штука)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РасхожденияПоАкту/РасхожденияПоАкту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасхожденияПоАкту</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РНК</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияРКМ/СостоянияРКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРКМ</name>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>СовпадаетСАктом</name>
  </enumValues>
  <enumValues>
    <name>НеСовпадаетСАктом</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/РекламационнаяНакладная/ObjectModule.bsl
// Катаев+ 19/03/13
Перем мСозданиеНевозможно Экспорт;
// Катаев- 19/03/13
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		= Модифицированность();
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаявкаНаРекламацию") Тогда
		НужноВыгружать = Ложь;
	Иначе
		НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
			
		// Шворобей ВЮ 28.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1244
		Если ЭтоНовый() И ВидРекламации = Перечисления.ВидыРекламаций.Возврат 
			И Месяц(Дата) <> Месяц(ТекущаяДатаСеанса()) Тогда
			СообщитьОбОшибке("Месяц даты РКМ не совпадает с текущим!!!");
			Отказ = Истина;
		КонецЕсли;
		// Шворобей ВЮ 28.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1244
		
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокОснование.Метаданные().Имя="Перемещение" И ДокОснование.Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код Тогда
			СообщитьОбОшибке("Рекламационные накладные на перемещения вводятся только на складе отправителе !!!");
			Отказ=Истина;
		КонецЕсли;
		
		 //крохин начало 05.02.2014
		 //иногда не отрабатывает "перед удалением"
		Если ПометкаУдаления И (Отработано или ПервичнаяПриемка) Тогда
			СообщитьОбОшибке("Невозможно удалить рекламацию в состоянии Предварительная обработка или Отработано.");
			Отказ=Истина;
		КонецЕсли;
		//крохин конец 05.02.2014
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	
	
	//нечаева 23,12,16 +++
	//меняем и дату КСФ
	Если НЕ ОбменДанными.Загрузка Тогда
		
		//нечаева 03,010,16++
		#если клиент	Тогда
			// нечаева 29,08,16+++
			
			КСФ=Неопределено;
			КСФ=КСчетФактураНакладной(ЭтотОбъект.Ссылка,Организация);
			
					
			если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения  
				и ВидРекламации=Перечисления.ВидыРекламаций.Вычерк  Тогда
				
				// нечаева 23,08,16+++ 				
				Если НЕ КСФ.Пустая() Тогда
					// снимаем проведение
					КСФ_Объект=КСФ.ПолучитьОбъект();
					КСФ_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения,РежимПроведенияДокумента.Неоперативный);
					
				КонецЕсли;		
				
			КонецЕсли;
			// нечаева 29,08,16+++
			Если НЕ КСФ.Пустая() Тогда
				//крохин начало 06.05.2021
				//перед записью дата ещё старая
				//Если КСФ.дата<> ЭтотОбъект.Ссылка.Дата Тогда
				//	КСФ_Объект=КСФ.ПолучитьОбъект();
				//	КСФ_Объект.Дата = ЭтотОбъект.Дата;
				//	КСФ_Объект.записать();
				//КонецЕсли;
				Если КСФ.дата<> Дата Тогда
					КСФ_Объект=КСФ.ПолучитьОбъект();
					КСФ_Объект.Дата = Дата;
					КСФ_Объект.записать();
				КонецЕсли;

				//крохин конец 06.05.2021
			КонецЕсли;
			
		#конецЕсли
	КонецЕсли;
	//нечаева 23,12,16 ---
	
	
	////нечаева 14,07,14 +++
	//Если ЭтотОбъект.Модифицированность() = Истина и ВидРекламации = Перечисления.ВидыРекламаций.Вычерк  Тогда
	//	ДокОснование.получитьобъект().УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.НеВыписаны);
	//конецЕсли;
	////нечаева 14,07,14 *--
	//
	
	//крохин начало 22.01.2020
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
			Если ДокОснование.СуммаСкидкиДС <> 0 Тогда
				СуммаСкидкиДСДоИзменения = ДокОснование.СуммаСкидкиДС;
				Если ДокОснование.СуммаДокумента <> 0 Тогда
				ПроцентИзмененияСкидкиДС = СуммаДокумента/ДокОснование.СуммаДокумента;
			Иначе
				ПроцентИзмененияСкидкиДС = 0;
			КонецЕсли;
			СуммаСкидкиДС = ПроцентИзмененияСкидкиДС*СуммаСкидкиДСДоИзменения;
			ДоговорСкидкиДС = ДокОснование.ДоговорСкидкиДС;
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;
    //крохин конец 22.01.2020
	
	//крохин начало 14.06.2020
	//требуется изменение статуса претензии
	Если Не ОбменДанными.Загрузка И РежимЗаписи=РежимЗаписиДокумента.Проведение И НЕ ПретензияПолучателя.Пустая() И ПретензияПолучателя.Проведен  И ПретензияПолучателя.СтатусПретензии <> Перечисления.СтатусыПретензииПокупателя.Завершена И ПретензияПолучателя.СтатусПретензии <> Перечисления.СтатусыПретензииПокупателя.ОформлениеДокументов Тогда
		КоличествоПретензияПолучателя = 0;
		ВсегоПретензияПолучателя = 0;
		Для Каждого СтрокаТЧ Из ПретензияПолучателя.Товары Цикл
			Если СтрокаТЧ.Решение = Перечисления.СостоянияКоррекции.Принята Тогда
				КоличествоПретензияПолучателя = КоличествоПретензияПолучателя + СтрокаТЧ.Количество;
				ВсегоПретензияПолучателя = ВсегоПретензияПолучателя + СтрокаТЧ.Всего;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоДокумента = КоличествоПретензияПолучателя И СуммаДокумента = ВсегоПретензияПолучателя Тогда
			ДокПретензияПолучателя = ПретензияПолучателя.ПолучитьОбъект();
			Если ДокОснование.Метаданные().Имя = "Перемещение" Тогда
				
				ДокПретензияПолучателя.СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.Завершена;
				ДокПретензияПолучателя.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
				ДокПретензияПолучателя.СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.ОформлениеДокументов;
				ДокПретензияПолучателя.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	//крохин конец 14.06.2020
	
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4275
	СтруктураВозврата = Документы.РекламационнаяНакладная.ПроверкаДублейЧЗ(ШтрихкодыУпаковок.Выгрузить());
	Если СтруктураВозврата.ЕстьДубли = Истина Тогда
		СообщитьОбОшибке("Есть дубли ШК упаковок");
		Отказ = Истина;
	КонецЕсли;
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4275
	//Валетов + 02,06,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-237
	Если ЭтоНовый() И Подразделение.Закрыто Тогда 
		Подразделение = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Справочники.Подразделения.ПустаяСсылка(),"ПодразделениеЗаменыВРКМ"); 
	КонецЕсли;
	//Валетов - 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Отработано=Ложь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	если ВидРекламации=Перечисления.ВидыРекламаций.Рекламация  тогда
		Сообщить("Запрещено проводить рекламацию с типом - рекламация.");
		отказ=Истина;
	КонецЕсли;
	Если НЕ ОбменДанными.Загрузка И НЕ ПараметрыСеанса.ЗапущенаОбработка Тогда
	#если клиент Тогда
		Если ПараметрыСеанса.ЭтотУзел.Код = "SNL" И НЕ ПустаяСтрока(Склад.КодФизическогоУзла) И ВидРекламации <> Перечисления.ВидыРекламаций.Возврат Тогда	
			сообщить("РКМ и КЦН проводятся только на складе!");
			если не РольДоступна("Администратор") тогда 
				отказ = истина;
				возврат;
			КонецЕсли; 
		КонецЕсли;	
	#КонецЕсли
	КонецЕсли;
	
	Если НЕ ПроводитьПоОстаткам Тогда 
		//+++Чирков 30.04.2026 СФ на АВ - промежуточные договора возвратов
		Если ВидРекламации = Перечисления.ВидыРекламаций.Возврат И 
			ИспользоватьВспомогательныеДоговораПриВозвратах(ЭтотОбъект.Дата) Тогда        
			
			ДвиженияПоВзаиморасчетам = Неопределено;
			рПроведения = ПроведениеПоРегистрамВзаиморасчетов(Ссылка, ДвиженияПоВзаиморасчетам);
			Если рПроведения.Результат = 1 Тогда			
				ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам, ОбменДанными.Загрузка);
			КонецЕсли;			
		КонецЕсли;
		//---Чирков 30.04.2026 СФ на АВ - промежуточные договора возвратов
		
		Возврат;  
	КонецЕсли;
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	ДвиженияПоРегистрам=Неопределено;	
	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	
	Результат=РезультатПроведения["Результат"];
	//крохин начало 08.12.2011
	Если ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда
		ДвиженияПоВзаиморасчетам=Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
	КонецЕсли;
	//крохин конец 08.12.2011
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));
	КонецЕсли;
	
	
	Если Не Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);		
	КонецЕсли;
	//крохин начало 08.12.2011
	Если ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда
		Если Не Отказ Тогда
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,ОбменДанными.Загрузка);		
		КонецЕсли;
		
	КонецЕсли;
	//крохин конец 08.12.2011
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" И ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
		РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, ОбменДанными.Загрузка);
	КонецЕсли;
	//крохин конец 05.05.2020
    //+HELP-7109 20251112 Михайловский 
	Если ДокОснование.Метаданные().Имя = "ПриходнаяНакладная" И ПроводитьПоОстаткам Тогда
		//ДвиженияПоОстаткамТМЦ = Неопределено;
		//РезультатПроведения = ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоОстаткамТМЦ);
		////ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦ, ОбменДанными.Загрузка);
		//ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦ, Истина); 
		// делаю фиксом, т. к. пред кусок не работает
		ФиксДвижОстТМЦ();
	КонецЕсли;
	//-HELP-7109 20251112 Михайловский
	
	//крохин начало 22.01.2020
	//при заполнении "суммы скидки" формируются доп. проводки
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить(); 
	Если СуммаСкидкиДС <> 0 Тогда
            Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
			
			//++Данилова Е.В. 03.10.2025 HELP-7050 
			Если Дата >= дата(2025,09,01) Тогда
				
				Движение.Подразделение		= ?(ЗначениеЗаполнено(Подразделение),Подразделение,ДокОснование.Подразделение);
			Иначе 
				Движение.Подразделение		= ДокОснование.Подразделение;
			КонецЕсли;
			//Движение.Подразделение		= ДокОснование.Подразделение;
			//--Данилова Е.В. 03.10.2025			
			Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 570"); //Трейд-маркетинг
			
			Движение.СуммаУпр		= глПересчет(СуммаСкидкиДС, Валюта, Курс, ВалютаУпр, Дата);	
			
			Движение.СуммаДокумента	= СуммаДокумента;
			
			Движение.ВалютаДокумента= Валюта;
			
			Движение.Комментарий    = "скидка по ДС";

			
			Движение.ДатаЗаписи		= ТекущаяДата();
	КонецЕсли;		

	//крохин конец 22.01.2020
	
	// Катаев+ 18/03/13 Проверяем наличие акта. Если акт есть, то заносим данные в регистр и делаем проверку на соответсвие данных по акту и рекламации
	Если не Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АктПриемки.Ссылка
		|ИЗ
		|	Документ.АктПриемки КАК АктПриемки
		|ГДЕ
		|	АктПриемки.РНК = &РНК
		|	И АктПриемки.Проведен";
		Запрос.УстановитьПараметр("РНК", ДокОснование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Акт = Выборка.Ссылка.ПолучитьОбъект();
			//крохин начало 15.12.2018
			//ошибка - Действие не может выполняться в режиме загрузки данных
			//Акт.ОбменДанными.Загрузка = Истина;
			//крохин конец 15.12.2018
			Если Отработано Тогда
				Акт.СостояниеДокумента = Перечисления.СостоянияНакладной.Принята;
			Иначе
				Акт.СостояниеДокумента = Перечисления.СостоянияНакладной.ВРаботе;
			КонецЕсли;
			Акт.СостоянияРКМ = Перечисления.СостоянияРКМ.СовпадаетСАктом;
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				// регистр РасхожденияПоАкту Приход
				Движение = Движения.РасхожденияПоАкту.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.РНК = ДокОснование;
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Отправлено = ТекСтрокаТовары.КоличествоИсх;
				Движение.Принято = ТекСтрокаТовары.КоличествоФакт;
			КонецЦикла;
			// Получаем остатки по регистру
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасхожденияПоАктуОстатки.Номенклатура,
			|	РасхожденияПоАктуОстатки.ОтправленоОстаток,
			|	РасхожденияПоАктуОстатки.ПринятоОстаток
			|ИЗ
			|	РегистрНакопления.РасхожденияПоАкту.Остатки(, РНК = &РНК) КАК РасхожденияПоАктуОстатки";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НайденнаяСтрока = товары.Найти(Выборка.Номенклатура,"Номенклатура");
				Если НайденнаяСтрока = Неопределено Тогда
					Акт.СостоянияРКМ = Перечисления.СостоянияРКМ.НеСовпадаетСАктом;
					Прервать;
				ИначеЕсли НайденнаяСтрока.КоличествоИсх <> Выборка.ОтправленоОстаток  или НайденнаяСтрока.КоличествоФакт <> Выборка.ПринятоОстаток Тогда
					Акт.СостоянияРКМ = Перечисления.СостоянияРКМ.НеСовпадаетСАктом;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//катаев+ 20/05/13
			//Акт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Попытка
				//крохин начало 28.05.2013
				//пока закомментировал
				Акт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				//крохин конец 28.05.2013
			Исключение
			КонецПопытки;
			//Катаев- 20/05/13
		КонецЕсли;
	КонецЕсли;
	//Валетов + 17,04,2025 Создание ХКМ для движения регистра Статусы КМ Факт
	//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4172  
	Если НЕ Отказ 
		И ШтрихкодыУпаковок.Количество() > 0 
		//И НЕ ЭтоНовый() 
		И НЕ Документы.ХранилищеКодовМаркировки.ПроверитьНаличиеХКМ(Ссылка,Перечисления.ПланФакт.Факт) Тогда
		//Валеов+ 27,05,2025 Закоментировал проверку, иногда не создается ХКМ если РКМ СРАЗУ заполняют марками при создании
		//Если НЕ ШтрихкодыУпаковок.Количество() = Ссылка.ШтрихкодыУпаковок.Количество() Тогда
			//РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ПНК_Факт(Ссылка);
			//  Так не работает потому, что нет ЛН к РКМ с марками.Сделаем свой аналог. 
			РезультатРаботыСХКМ = Создать_ХКМ_к_РКМ(Ссылка);	
			Если не РезультатРаботыСХКМ.Успешно тогда
				РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
				СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
				отказ=Истина;	
			КонецЕсли;
			
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//+HELP-7109 20251112 Михайловский
Процедура ФиксДвижОстТМЦ()
	
	Движения.ОстаткиТМЦ.Очистить();
	Движения.Записать();
	Движения.ОстаткиТМЦ.Записывать = Истина;
	ВидДвиж = ВидДвиженияНакопления.Расход;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Количество Тогда
			Движение = Движения.ОстаткиТМЦ.Добавить();
			Движение.ВидДвижения = ВидДвиж;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Всего;	
			Движение.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратПоставщику;
			Движение.Отправитель = Склад;
			Движение.ПунктДоставки = ПунктДоставки;
			Движение.ВалютаДокумента = Валюта;
			Движение.Подразделение = Склад.Подразделение;
		КонецЕсли;
	КонецЦикла; 
	Движения.Записать();
	
КонецПроцедуры //-HELP-7109 20251112 Михайловский	

Функция Создать_ХКМ_к_РКМ(СсылкаРКМ) 
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);		
		
	ПланФакт = Перечисления.ПланФакт.Факт;
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	|ГДЕ
	|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
	|	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт";
	Запрос.УстановитьПараметр("ДокОснование",	СсылкаРКМ);
	Запрос.УстановитьПараметр("ПланФакт",		ПланФакт);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Если РезультатЗапроса.Следующий() Тогда
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДокОбъект.ШтрихкодыУпаковок.Очистить();
	Иначе				
		ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
		
		ДокОбъект.Дата	= ТекущаяДата();
		ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", СсылкаРКМ, Истина));
	КонецЕсли;
	//Валетов + 22,02,2025
	//ПУСТАЯ ЗАДАЧА Добавление движения ХКМ для РКМ с пересортом. Одна КМ "+" на склад, вторая "-" покупателю.
	
	ДокОбъект.ПланФакт	= ПланФакт;
	//+HELP-7109 20251112 Михайловский 
	//ДокОбъект.Операция	= Перечисления.СкладскиеОперации.Приемка; 
	ДокОбъект.Операция	= ?(ТипЗнч(Ссылка.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная"), Перечисления.СкладскиеОперации.Отгрузка, Перечисления.СкладскиеОперации.Приемка);
	//-HELP-7109 20251112 Михайловский
	ДокОбъект.Организация = Организация;
	ДокОбъект.ДокОснование = Ссылка;
	//+HELP-7109 20251112 Михайловский
	//ДокОбъект.Отправитель = Корреспондент;
	//ДокОбъект.Получатель = Склад.Подразделение; 
	ДокОбъект.Отправитель = ?(ДокОбъект.Операция = Перечисления.СкладскиеОперации.Отгрузка, Склад.Подразделение, Корреспондент);
	ДокОбъект.Получатель = ?(ДокОбъект.Операция = Перечисления.СкладскиеОперации.Отгрузка, Корреспондент,  Склад.Подразделение);
	//-HELP-7109 20251112 Михайловский
	
	//ДокОбъект.ШтрихкодыУпаковок.Загрузить(ШтрихкодыУпаковок.Выгрузить(,"ШтрихкодУпаковки"));
	Для Каждого ШтрихКодУпаковки Из ШтрихкодыУпаковок Цикл
		СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки.ШтрихкодУпаковки;
		
		Если ШтрихКодУпаковки.СтатусУКонтрагента = Перечисления.СтатусыМарокУКонтаргента.Излишек Тогда
			СтрокаТЧ.Операция = Перечисления.СкладскиеОперации.Отгрузка;
		Иначе 
			СтрокаТЧ.Операция = Перечисления.СкладскиеОперации.Приемка;
		КонецЕсли;
		
	КонецЦикла;
	//Валетов -
	ДокОбъект.ПометкаУдаления = Ложь; 
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	
	Результат.Успешно = Истина;	
	
	Возврат Результат;
	
КонецФункции
//Валетов -  


Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования = Основание.Метаданные().Имя;
	
	Если ВидОснования="ЗаявкаНаРекламацию" Тогда
		ДокОснование = Основание.ДокОснование;
		ЗаявкаНаРекламацию = Основание;
	Иначе
		ДокОснование = Основание;
	КонецЕсли;
	
	//Нечаева 15,01,14  +++
	Если ВидОснования="Перемещение" Тогда 
		Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
        //ВидРекламации=Перечисления.ВидыРекламаций.Вычерк 
		    Сообщить("Не возможно создание Вычерка на основании документа Перемещение");
		 	мСозданиеНевозможно=Истина;
        КонецЕсли;
	КонецЕсли;
	//Нечаева 15,01,14  ---

	//Нечаева09.12.14  +++ по письму Колобкова. К ним только Претензии.
	Если ВидОснования="ПриходнаяНакладная" Тогда 
		    Сообщить("Не возможно создание РКМ на основании документа ПНК. Можно создавать только Претензию.");
		 	мСозданиеНевозможно=Истина;
       
	КонецЕсли;
	//Нечаева 09.12.14  ---
	
	// Катаев+ 19/03/13  Добавил заполнение на основании акта приемки
	Если ВидОснования = "АктПриемки" Тогда
		Если ДокОснование.РНК.Пустая() Тогда
			Сообщить("В акте приемки отсутствует РНК. Создание документа запрещено");
			мСозданиеНевозможно=Истина;
			Возврат;
		Конецесли;
		ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
		Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Менеджер");			
		Организация		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Организация");	
		ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"ТипЦен");
		ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"ТипСкидок");
		// нечаева 14,08,19+++
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Склад");
		// нечаева 14,08,19---

		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Скидка");
		//12.03.14 нечаева - цены слетают --
	Иначе
		ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
		Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");			
		Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");	
		ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
		ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
		//12.03.14 нечаева - цены слетают --
	КонецЕсли;
	// Катаев- 19/03/13 
	
	//крохин начало 29.01.2013
	//менеджер, для отчета "продажи"
	Менеджер			= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	
	//++Данилова Е.В. 03.10.2025 HELP-7050 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер); 
	Если НЕ ЗначениеЗаполнено(Подразделение)
		И ЕстьРеквизитДокумента("Подразделение",Докоснование.Метаданные()) Тогда
	
		Подразделение = ДокОснование.Подразделение; 	
	
	КонецЕсли;
	//--Данилова Е.В. 03.10.2025
	//крохин конец 29.01.2013
		
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" ИЛИ ВидОснования="ЗаявкаНаРекламацию" Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		//крохин начало 06.03.2012
		ВидОплаты = ДокОснование.ВидОплаты;
		//крохин конец 06.03.2012
		//крохин начало 24.05.2012
		ДатаОплаты = ДокОснование.ДатаОплаты;
		//крохин конец 24.05.2012
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Корреспондент	= ДокОснование.СкладПолучатель;
		Склад			= ДокОснование.Склад;
	// Катаев+ 19/03/13 
	ИначеЕсли Видоснования="АктПриемки"	 Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		ДатаОплаты = ДокОснование.РНК.ДатаОплаты;
		// нечаева 14,08,19+++
		Склад		= ДокОснование.РНК.Склад;
		// нечаева 14,08,19---

		//Катаев- 19/03/13
	Иначе
		Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");		
	КонецЕсли;	
	
	Если ВидОснования="ПриходнаяНакладная" И ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
		Поставщику=Истина;
		
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
				СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоИсх;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли; 			
		КонецЦикла;
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
				СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	//крохин начало 20.11.2011
	Если (ВидОснования = "РасходнаяНакладная" ИЛИ ВидОснования = "ЗаявкаНаРекламацию") И КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
		ВидРекламации = Перечисления.ВидыРекламаций.Вычерк;
	Иначе
		ВидРекламации = Перечисления.ВидыРекламаций.Рекламация;
	КонецЕсли;
	//крохин конец 20.11.2011
	
	
	//Катаев+ 19/03/13 Заполнение ТЧ на основании АктаПриемки и РНК
	
	
	// нечаева 24,02,016 убрала рнк из заполнения, не правильно считает нач. остаток, если несколько вычерков
	//Если ВидОснования="РасходнаяНакладная" Или ВидОснования="АктПриемки" Тогда // было
	Если  ВидОснования="АктПриемки" Тогда
		Если ВидОснования = "АктПриемки" Тогда
			РНК = ДокОснование.РНК;
			ДокОснование = ДокОснование.РНК;
		Иначе
			РНК =ДокОснование;
		КонецЕсли;
		Запрос = новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасхожденияПоАктуОстатки.Номенклатура,
		|	РасхожденияПоАктуОстатки.ОтправленоОстаток,
		|	РасхожденияПоАктуОстатки.ПринятоОстаток
		|ИЗ
		|	РегистрНакопления.РасхожденияПоАкту.Остатки(, РНК = &РНК) КАК РасхожденияПоАктуОстатки";
		Запрос.УстановитьПараметр("РНК", РНК);
		Выборка = запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ=Товары.Добавить();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.КоличествоИсх = Выборка.ОтправленоОстаток;
			СтрокаТЧ.КоличествоФакт = Выборка.ПринятоОстаток;
			СтрокаТЧ.Количество	= СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
		КонецЦикла;
	КонецЕсли;
	
	//Катаев- 19/03/13
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	Если ВидОснования="РасходнаяНакладная" И  ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		СкладКомиссия = ДокОснование.СкладКомиссия;
	КонецЕсли;
	//крохин конец 05.05.2020
	
	// Шворобей ВЮ 15.12.2022 ++
	Если ВидОснования = "ЗаявкаНаРекламацию" Тогда
		
		Договор	= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
		
		Товары.Очистить();
		Для Каждого СтрокаТЧ ИЗ Основание.Товары Цикл
			Если СтрокаТЧ.ДельтаСогласовано <> 0 Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				
				НоваяСтрока.Количество = СтрокаТЧ.ДельтаСогласовано;
				// Кухарь А.Ю.  13.02.2023 начало
				//НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				НоваяСтрока.Всего			  = НоваяСтрока.Количество * НоваяСтрока.Цена;
				РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект,"ОтВсего");			
				// Кухарь А.Ю.  13.02.2023 конец

				
				НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТЧ.Номенклатура);
				НоваяСтрока.НДС = ПроцентНДСпоСтавке(НоваяСтрока.СтавкаНДС) * НоваяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	// Шворобей ВЮ 15.12.2022 ++
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	//доработки Чиркова для свертки базы, 04.08.2016 начало
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	//доработки Чиркова для свертки базы, начало 04.08.2016 конец
	
	//Нечаева 27,01,14 +++
	#Если клиент Тогда
		Если Отработано или ПервичнаяПриемка Тогда
			Сообщить("Невозможно удалить рекламацию в состоянии Предварительная обработка или Отработано.");
			Отказ=истина;
		КонецЕсли;	
	#КонецЕсли 
	//Нечаева 27,01,14  ----
	

КонецПроцедуры

//Катаев+ 08/10/14       
Процедура ПриЗаписи(Отказ)
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

// Шворобей ВЮ 12.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701
НужноВыгружать = Ложь;
// Шворобей ВЮ 12.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701
